# Pandas Tutorial Part 1

This is the first part of a Pandas tutorial, introducing concepts like 

- Series and DataFrames
- Indexing using loc and iloc
- Conditional operations
- Generation of basic statistical summaries
- Grouping and 
- Sorting

### Table of Contents

* [1. Introduction](#chapter1)
    * [1.1 What is Pandas?](#section_1_1)
    * [1.2 Installing Pandas](#Section_1_2)
        * [1.2.1 Installing Pandas with Anaconda](#section_1_2_1)
        * [1.2.2 Installing Pandas with PyPI](#section_1_2_2)
* [2. Series and DataFrames](#chapter2)
    * [2.1 Creating DataFrames](#section_2_1)
    * [2.2 Properties of DataFrames](#section_2_2)
        * [2.2.1 df.shape](#section_2_2_1)
        * [2.2.2 df.head and df.tail](#section_2_2_2)
        * [2.2.3 Extracting a DataFrame range](#section_2_2_3)
    * [2.3 Accessing columns](#section_2_3)
        * [2.3.1 Basic column operations](#section_2_3_1)
    * [2.4 Accessing rows with loc and iloc](#section_2_4)
* [3. Group data using GroupBy](#chapter3)
    * [3.1 Creating a group object](#section_3_1)
    * [3.2 Grouping with multiple indexes](#section_3_2)
* [4. Concatenation](#chapter4)
    * [4.1 Concatenate Series](#section_4_1)
    * [4.2 Concatenate DataFrames](#section_4_2)  
         * [4.2.1 Concatenate DataFrames by rows](#section_4_2_1)
         * [4.2.2 Concatenate DataFrames by columns](#section_4_2_2)
         * [4.2.3 Order matters! Rearranging column orders...](#section_4_2_3)
     * [4.4 Concatenating multiple DataFrames and Series](#section_4_4) 
* [5. Sorting data in a DataFrame](#chapter5)
    * [5.1 Sort columns ](#section_5_1)
    * [5.2 Sorting multiple columns](#section_5_2)   
    * [5.3 Missing values](#section_5_3)
* [6. Conclusion](#chapter6)

# 1. Introduction <a class="anchor" id="chapter1"></a>

## 1.1 What is Pandas? <a class="anchor" id="section_1_1"></a>

Todays aritificial  intelligence (AI) algorithms rely on data, and often a lot of it. Preparing data before training an algorithm or fitting a model is a crucial step.
Pandas is a Python library which deals with tabular and sequential data and can be used to manipulate, clean, read and write data.
Pandas converts data into a either a 1D structure, called for a *Series*, or a 2D structure, called a *DataFrame*, which is a table-like structure consisting of labeled rows and columns. A DataFrame can be manipulated and analyzed and stored as several different file types (e.g. .csv or excel).

Pandas is fast, relatively easy to learn, and the best thing: It has Python support!

## 1.2 Installing Pandas <a class="anchor" id="section_1_2"></a>

### 1.2.1 Installing Pandas with Anaconda <a class="anchor" id="section_1_2_1"></a>

To install Pandas using the Anaconda environment, type:

```python
conda install Pandas
```

For a specific Pandas version, you can use:

```python
conda install Pandas = 1.4.1
```

### 1.2.2 Installing Pandas with PyPI <a class="anchor" id="section_1_2_2"></a>

To install Pandas using pip:

```python
pip3 install Pandas
```

or 

```python
pip3 install Pandas = 1.4.1
```

for a specific version of the library.

# 2. Series and DataFrames <a class="anchor" id="chapter2"></a>

## 2.1 Series <a class="anchor" id="section_2_1"></a>
Lets dive into Pandas and create our first Series. A series is a 1D structure that comprises key-value pair. If you a familier with the Python programming language, a Series should remind you of a dictionary.

In [3]:
# import pandas
import pandas as pd
# you don't need this to work with pandas, but I will use the display function in some parts of the notebook
from IPython.display import display

In [4]:
# create a Series

fruits = pd.Series(["apples", "oranges", "bananas"])

fruits

0     apples
1    oranges
2    bananas
dtype: object

You can see that the keys in the Series are values from 0-1, while the values are the name of the fruits. A Series can also be generated for other datatype, like in example float or integer values.

In [5]:
#FLOAT SERIES
temperature = pd.Series([32.6, 34.1, 28.0, 35.9], index = ["a","b","c","d"])

print("TEMPERATURE IN CELSIUS")
print(temperature, "\n")

#INTEGER SERIES
factors_of_12 = pd.Series([1,2,4,6,12], name = "factors of 12")

print("FACTORS OF 12 SERIES")
print(factors_of_12, "\n")

TEMPERATURE IN CELSIUS
a    32.6
b    34.1
c    28.0
d    35.9
dtype: float64

FACTORS OF 12 SERIES
0     1
1     2
2     4
3     6
4    12
Name: factors of 12, dtype: int64

## 2.2 DataFrames <a class="anchor" id = "section_2_2" ></a>

A DataFrame representes a 2D table consisting of rows and columns. There are several differnt ways to create a DataFrame, namely using:

- dictionary data
- list data 
- lists of dictionaries or 
- from files.

We start with **dictionary data**:

In [6]:
# import pandas
import pandas as pd

cars = {
        'Brand': ['Honda', 'Toyota', 'Ford', 'Audi'],
        'Price': [22000,25000,27000,35000]
       }

df = pd.DataFrame(cars)

df

    Brand  Price
0   Honda  22000
1  Toyota  25000
2    Ford  27000
3    Audi  35000

As mentioned above, we can also use **list data** to create a DataFrame object:

In [7]:
cars = ['Honda', 'Toyota', 'Ford', 'Audi']
prices = [22000,25000,27000,35000]

df = pd.DataFrame(list(zip(cars, prices)))

df

        0      1
0   Honda  22000
1  Toyota  25000
2    Ford  27000
3    Audi  35000

We can see that the data in the DataFrame looks the same as in the dictionary case. The only difference between these two is that the columns are not labeled. Instead they are automatically indexed, from $i =0 ... n$ columns.

To add columns names, we can use the DataFrames columns variable, which should be provided as a list.

In [8]:
cars = ['Honda', 'Toyota', 'Ford', 'Audi']
prices = [22000,25000,27000,35000]

df = pd.DataFrame(list(zip(cars, prices)), columns = ['Brand', 'Price'])

df

    Brand  Price
0   Honda  22000
1  Toyota  25000
2    Ford  27000
3    Audi  35000

Now lets create a DataFrame from **lists of dictionaries**. The keys of the dictionary will become the columns, while the values become the values in the DataFrame.

In [9]:
df_dictlist = [{'Brand': 'Honda', 'Price': 22000, 'color': 'black'},
           {'Brand': 'Toyota', 'Price': 25000, 'color': 'blue'},
           {'Brand': 'Ford', 'Price': 27000, 'color': 'red'},
           {'Brand': 'Audi', 'Price': 35000, 'color': 'silver'}]

df = pd.DataFrame(df_dictlist)

df

    Brand  Price   color
0   Honda  22000   black
1  Toyota  25000    blue
2    Ford  27000     red
3    Audi  35000  silver

The last option I want to show is how to create a DataFrame object from a **.csv or text file**. For that, I prepared a .tx file (cars.txt) with cars, prices and brands as we have seen in the above example.

In [10]:
df = pd.read_csv('cars.txt')
df

    Brand  Price   color
0   Honda  22000   black
1  Toyota  25000    blue
2    Ford  27000     red
3    Audi  35000  silver

## 2.2 Properties of DataFrames <a class="anchor" id="section_2_2"></a>

DataFrames have some basic properties and functionality. We can look at different attributes, such as the size (shape) of a DataFrame, we can print the first (or the last) $n$ rows, look at the maximum and minimum values, extract data by indexing and so on...

### 2.2.1 df.shape <a class="anchor" id="section_2_2_1"></a>

Lets look at the shape of the car DataFrame.

In [11]:
print(df.shape)

(4, 3)

The result is a tuple indicating that our DataFrame as 4 rows and 2 columns

### 2.2.2 df.head and df.tail <a class="anchor" id="section_2_2_2"></a>

Sometimes we just want to check some of the entries in the DataFrame. I quick way of doing this is by using the head() and tail() functions.
head() returns the $n$ first rows, while tail() returns the $n$ last rows. Both function takes an integer variable as its input, which is the number of rows we want to extract.

In [12]:
# print the first n rows

df.head(2)

    Brand  Price  color
0   Honda  22000  black
1  Toyota  25000   blue

In [13]:
# print the last n rows

df.tail(2)

  Brand  Price   color
2  Ford  27000     red
3  Audi  35000  silver

### 2.2.3 Extracting a DataFrame range <a class="anchor" id="section_2_2_3"></a>

We can also pick a specific range of rows we want to extract. If you are familiar with numpy, you will recognize this type of indexing.

In [14]:
#Exract row 2 - 4 from the DataFrame

df[2:4]

  Brand  Price   color
2  Ford  27000     red
3  Audi  35000  silver

## 2.3 Accessing columns <a class="anchor" id="section_2_3"></a>
 
When we read an unknown dataset from a textfile, we have gain insight about the dataset. One way to start is by extracting the columns, to get information about column names or units of measurement. Columns can be extracted by using the *df.columns* function.

In [15]:
# Get the column names
df.columns

Index(['Brand', 'Price', 'color'], dtype='object')

Once we have information about the column names, we can use them to access individual columns.

In [16]:
# Get specific column by name
print(df.Brand)
print(df.color)

0     Honda
1    Toyota
2      Ford
3      Audi
Name: Brand, dtype: object
0     black
1      blue
2       red
3    silver
Name: color, dtype: object

In [17]:
# A different way to access the columns by name

print(df["Brand"])
print(df["Price"])

0     Honda
1    Toyota
2      Ford
3      Audi
Name: Brand, dtype: object
0    22000
1    25000
2    27000
3    35000
Name: Price, dtype: int64

**Note:** You can also access two or more columns simultaneously-

In [18]:
df[['Brand', 'Price']].head(2)

    Brand  Price
0   Honda  22000
1  Toyota  25000

### 2.3.1 Basic column operations <a class="anchor" id="section_2_3_1"></a>

There are some basic operations we can excecute on columns, such as:

- **max()** : Gets the maximum value of a column.
- **min()** : Gets the minimum value of a column.
- **mean()** : Gets the mean value of a column.
- **std()** : Gets the standard deviation of a column.

**Note** These statistics can also be summarized using the function *describe()*.

In addition, we can use condional operations to filter the result of a column:

- $>$ greater then
- $<$ smaller then
- $==$ equal to

In [19]:
df['Price'].max()

35000

In [20]:
df['Price'].min()

22000

In [21]:
df['Price'].mean()

27250.0

In [22]:
df['Price'].std()

5560.275772537426

We can get a summary of a columns statistic using the decribe() function.

In [23]:
df['Price'].describe()

count        4.000000
mean     27250.000000
std       5560.275773
min      22000.000000
25%      24250.000000
50%      26000.000000
75%      29000.000000
max      35000.000000
Name: Price, dtype: float64

Conditional operations can be applied to columns to find all entries that are smaller, larger or equal to a specific value.

In [24]:
df[df['Price'] > 30000]

  Brand  Price   color
3  Audi  35000  silver

In [25]:
df[df['Price'] < 30000]

    Brand  Price  color
0   Honda  22000  black
1  Toyota  25000   blue
2    Ford  27000    red

In [26]:
df[df['Price'] == 22000]

   Brand  Price  color
0  Honda  22000  black

## 2.4 Accessing rows with loc and iloc <a class="anchor" id="section_2_4"></a>
 
The loc and iloc functions are two additional ways to access the rows of a DataFrame:

- **loc** gets rows with a specific label.
- **iloc** gets rows at a given index (location)

In [27]:
df.loc[0]

Brand    Honda
Price    22000
color    black
Name: 0, dtype: object

In [28]:
df.iloc[0]

Brand    Honda
Price    22000
color    black
Name: 0, dtype: object

**Note** In this case, loc and iloc return exactly the same entry. Why is that? Our iloc function works as expected, returing the entry at index position 0. But what does loc do? 
Loc returns the row(s) with a specific label. The rows in our example are auto-indexed, with row *labels* from $0 - n-1$ rows. That menas that our loc function works as well, returning the row with label *0*.

Lets take a look at the indexes in our DataFrame:

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

Indexes starts at 0, end at 4, and are incremented with a step size of 1.
We can set new index names using the *set_index()* function. Lets define new indexes equal to the brand of the cars.

In [30]:
df.set_index('Brand')

        Price   color
Brand
Honda   22000   black
Toyota  25000    blue
Ford    27000     red
Audi    35000  silver

In [31]:
df.head(2)

    Brand  Price  color
0   Honda  22000  black
1  Toyota  25000   blue

**Problem!** Did you observe what just happened? We gave new labels to our indexes. If we print the first two rows of our DataFrame, nothing has changed though. The indexes are still in the range between $0-n-1$. The set_index() function creates a new DataFrame instead of changing the original one. 
We can solve this problem by setting df.set_index() equal to our original DataFrame.

In [32]:
df = df.set_index('Brand')
df

        Price   color
Brand
Honda   22000   black
Toyota  25000    blue
Ford    27000     red
Audi    35000  silver

An alternative way is to use set the **inplace** attribute of the set_index() function equal to True.

In [33]:
df = pd.read_csv('cars.txt')
# Use inplace=True to change the original DataFrame
df.set_index('Brand', inplace = True)
df

        Price   color
Brand
Honda   22000   black
Toyota  25000    blue
Ford    27000     red
Audi    35000  silver

Now lets test the iloc and loc function one more time. We use iloc in excatly the same way as before, by proving an integer index to the function. The loc function will be used in a slightly different way. Instead of providing an integer, we will now provide a string variable to the function.

In [34]:
df.loc['Honda']

Price    22000
color    black
Name: Honda, dtype: object

In [35]:
df.iloc[0]

Price    22000
color    black
Name: Honda, dtype: object

# 3. Group data using GroupBy <a class="anchor" id="chapter3"></a>

Sometimes our data contains repeated values which are connected to varying ones. Consider having a dataset of students containing the grades for two semester of differents subjects.

In [36]:
student_df = pd.read_csv('students.csv')
student_df

     name    subject  sem1  sem2
0   Nisha    Physics    88    91
1    Arun    Physics    92    95
2    Neha    Physics    78    81
3   Varun    Physics    60    63
4   Nisha  Chemistry    61    64
5    Arun  Chemistry    72    75
6    Neha  Chemistry    82    85
7   Varun  Chemistry    59    62
8   Nisha       Math    70    73
9    Arun       Math    48    51
10   Neha       Math    83    86
11  Varun       Math    63    66
12  Nisha    Biology    71    74
13   Arun    Biology    84    87
14   Neha    Biology    57    60
15  Varun    Biology    71    74

We can see that we have a total of four students, whos name is used several times to describe different subjects and the students marks during the first and second semester.

## 3.1 Creating a group object <a class="anchor" id="section_3_1"></a>

Using the *groupby()* function, we can generate a group the students names. We also store tthe group into a new variable students.

In [37]:
students = student_df.groupby(['name'])
students

You can see that the students variable is a DataFramGroupBy object. Using the group, we can perform different operations on it.

In [38]:
# show the first group
students.first()

       subject  sem1  sem2
name
Arun   Physics    92    95
Neha   Physics    78    81
Nisha  Physics    88    91
Varun  Physics    60    63

In [39]:
# show the last group
students.last()

       subject  sem1  sem2
name
Arun   Biology    84    87
Neha   Biology    57    60
Nisha  Biology    71    74
Varun  Biology    71    74

In [40]:
# Compute maximum, minimum and average values of the first semesters marks
students['sem1'].max(), students['sem1'].min(), students['sem1'].mean()

(name
 Arun     92
 Neha     83
 Nisha    88
 Varun    71
 Name: sem1, dtype: int64,
 name
 Arun     48
 Neha     57
 Nisha    61
 Varun    59
 Name: sem1, dtype: int64,
 name
 Arun     74.00
 Neha     75.00
 Nisha    72.50
 Varun    63.25
 Name: sem1, dtype: float64)

We are also able to iterate through the different groups in the students variable.

In [41]:
students.groups

{'Arun': [1, 5, 9, 13], 'Neha': [2, 6, 10, 14], 'Nisha': [0, 4, 8, 12], 'Varun': [3, 7, 11, 15]}

In [42]:
for student, df in students:
    print(student)
    print(df)

Arun
    name    subject  sem1  sem2
1   Arun    Physics    92    95
5   Arun  Chemistry    72    75
9   Arun       Math    48    51
13  Arun    Biology    84    87
Neha
    name    subject  sem1  sem2
2   Neha    Physics    78    81
6   Neha  Chemistry    82    85
10  Neha       Math    83    86
14  Neha    Biology    57    60
Nisha
     name    subject  sem1  sem2
0   Nisha    Physics    88    91
4   Nisha  Chemistry    61    64
8   Nisha       Math    70    73
12  Nisha    Biology    71    74
Varun
     name    subject  sem1  sem2
3   Varun    Physics    60    63
7   Varun  Chemistry    59    62
11  Varun       Math    63    66
15  Varun    Biology    71    74

To access a specific group, we can use the *get_group* function.

In [43]:
student_df.groupby(['name']).get_group('Neha')

    name    subject  sem1  sem2
2   Neha    Physics    78    81
6   Neha  Chemistry    82    85
10  Neha       Math    83    86
14  Neha    Biology    57    60

To get a statistical summary of the different groups, we can use the describe() function that we have seen in the beginning og this tutorial.

In [44]:
students.describe()

       sem1                                                    sem2         \
      count   mean        std   min    25%   50%    75%   max count   mean
name
Arun    4.0  74.00  19.183326  48.0  66.00  78.0  86.00  92.0   4.0  77.00
Neha    4.0  75.00  12.192894  57.0  72.75  80.0  82.25  83.0   4.0  78.00
Nisha   4.0  72.50  11.269428  61.0  67.75  70.5  75.25  88.0   4.0  75.50
Varun   4.0  63.25   5.439056  59.0  59.75  61.5  65.00  71.0   4.0  66.25


             std   min    25%   50%    75%   max
name
Arun   19.183326  51.0  69.00  81.0  89.00  95.0
Neha   12.192894  60.0  75.75  83.0  85.25  86.0
Nisha  11.269428  64.0  70.75  73.5  78.25  91.0
Varun   5.439056  62.0  62.75  64.5  68.00  74.0

## 3.2 Grouping with multiple indexes <a class="anchor" id="section_3_2"></a>

We have seen that we can sort data by a specific column using the groupby function. Another way to group data is by using multiple indexes.

In [45]:
student_df.sort_values(by = ['name'], inplace = True)
student_df

     name    subject  sem1  sem2
1    Arun    Physics    92    95
5    Arun  Chemistry    72    75
9    Arun       Math    48    51
13   Arun    Biology    84    87
2    Neha    Physics    78    81
6    Neha  Chemistry    82    85
10   Neha       Math    83    86
14   Neha    Biology    57    60
0   Nisha    Physics    88    91
4   Nisha  Chemistry    61    64
8   Nisha       Math    70    73
12  Nisha    Biology    71    74
3   Varun    Physics    60    63
7   Varun  Chemistry    59    62
11  Varun       Math    63    66
15  Varun    Biology    71    74

In [46]:
student_df.set_index(['name', 'subject'], inplace = True)
student_df

                 sem1  sem2
name  subject
Arun  Physics      92    95
      Chemistry    72    75
      Math         48    51
      Biology      84    87
Neha  Physics      78    81
      Chemistry    82    85
      Math         83    86
      Biology      57    60
Nisha Physics      88    91
      Chemistry    61    64
      Math         70    73
      Biology      71    74
Varun Physics      60    63
      Chemistry    59    62
      Math         63    66
      Biology      71    74

We have now created a DataFrame with multiple indexes. If we want to group this data we can use **level numbers**. In our case, level 0 = name and level 1 = subject.

In [47]:
grouped = student_df.groupby(level = 0)
grouped.sum()

       sem1  sem2
name
Arun    296   308
Neha    300   312
Nisha   290   302
Varun   253   265

The above operation groups the data by the names and sums up all grades from semester 1 and semester 2.

In [48]:
grouped = student_df.groupby(level = 1)
grouped.sum()

           sem1  sem2
subject
Biology     283   295
Chemistry   274   286
Math        264   276
Physics     318   330

This function groups the DataFrame by the subject and computes the sum of all marks for each subject for semester 1 and semester 2.

# 4. Concatenation <a class="anchor" id="chapter4"></a>

Most of the times we want to collect data from several sources like .txt, .csv or excel files, sql databases or from other sources. These data can be read into different DataFrames or Series, which we want to combined to a single, large Series/DataFrame. This can be achieved by **concatenation**.

## 4.1 Concatenate Series <a class="anchor" id="section_4_1"></a>

In [49]:
# Create two different Series
david = pd.Series(['d','a','v','i','d'])
mike = pd.Series(['m','i','k','e'])

#use the concant function to combine the two Series
pd.concat([david, mike])

0    d
1    a
2    v
3    i
4    d
0    m
1    i
2    k
3    e
dtype: object

## 4.2 Concatenate DataFrames <a class="anchor" id="section_4_1"></a>

### 4.2.1 Concatenate DataFrames by rows <a class="anchor" id="section_4_2_1"></a>

Now lets try the same thing for DataFrames. We eill create two DataFrames and concatenate them to a single one.

In [50]:
# create first DataFrame
david_scores = {
                'subjects': ['math', 'physics', 'chemistry', 'biology'], 
                'sem1': [60, 70, 80, 90],
                'sem2': [63, 71, 85, 89],
                }
david_df = pd.DataFrame(david_scores)

# create second DataFrame
mike_scores = {
                'subjects': ['math', 'physics', 'chemistry', 'biology'], 
                'sem1': [63, 77, 89, 92],
                'sem2': [73, 81, 88, 83],
                }

mike_df = pd.DataFrame(mike_scores)

display(david_df)
display(mike_df)

    subjects  sem1  sem2
0       math    60    63
1    physics    70    71
2  chemistry    80    85
3    biology    90    89

    subjects  sem1  sem2
0       math    63    73
1    physics    77    81
2  chemistry    89    88
3    biology    92    83

Now that we have the two DataFrames, lets concatenate them using the *concat()* function.

In [51]:
df = pd.concat([david_df, mike_df])
df

    subjects  sem1  sem2
0       math    60    63
1    physics    70    71
2  chemistry    80    85
3    biology    90    89
0       math    63    73
1    physics    77    81
2  chemistry    89    88
3    biology    92    83

From the above result we can see that both DataFrames have now been combined to a single one. Nevertheless, the indexes start from 0 up to 3 and are repeated (starting at 0 again) after that.
As you can see, it is really difficult to distinguish between the two DataFrames.

One way to solve this is by adding a key to each DataFrame during concatenation.

In [52]:
df = pd.concat([david_df, mike_df], keys = ['david', 'mike'])
df

          subjects  sem1  sem2
david 0       math    60    63
      1    physics    70    71
      2  chemistry    80    85
      3    biology    90    89
mike  0       math    63    73
      1    physics    77    81
      2  chemistry    89    88
      3    biology    92    83

Even though we have combined the data into a single DataFrame, it is still easy to distinguish between the two. The key provides us with an additional index that we can use to index the DataFrame itself.

In [53]:
df.loc['david']

    subjects  sem1  sem2
0       math    60    63
1    physics    70    71
2  chemistry    80    85
3    biology    90    89

From the above result we can see that both DataFrames have now been combined to a single one. Nevertheless, the indexes start from 0 up to 3 and are repeated (starting at 0 again) after that. That might be ok, depending on the project you are working on, but lets fix this anyway.

To create new indexes for the concenated DataFrame, we can add the argument *ignore_index = True* to the concatenate function. Like the argument name indicates, it ignores the indexes of the single DataFrames and creates new ones for the combined DataFrame.

In [54]:
df = pd.concat([david_df, mike_df], ignore_index = True)
df

    subjects  sem1  sem2
0       math    60    63
1    physics    70    71
2  chemistry    80    85
3    biology    90    89
4       math    63    73
5    physics    77    81
6  chemistry    89    88
7    biology    92    83

Now the index starts at 0 and goes all the way up to 7.

### 4.2.2 Concatenate DataFrames by columns <a class="anchor" id="section_4_2_2"></a>

What we have seen so far is that we can combine multiple Series and DataFrames by concatenation. All combined Series/DataFrames we generated so far have been combined row-wise. As an alternative, we can also concatenate two sources column-wise.

Imagine that one of the students just receive the marks for the third semester. Instead of combining the third semester grades row-wise, we need to make a new column *sem3*.

In [57]:
# create additional DataFrame
sem3_scores = {
                'subjects': ['math', 'physics', 'chemistry', 'biology'], 
                'sem3': [50, 64, 88, 81]                
                }
sem3_scores_df = pd.DataFrame(sem3_scores)

df = pd.concat([david_df, sem3_scores_df])
df

    subjects  sem1  sem2  sem3
0       math  60.0  63.0   NaN
1    physics  70.0  71.0   NaN
2  chemistry  80.0  85.0   NaN
3    biology  90.0  89.0   NaN
0       math   NaN   NaN  50.0
1    physics   NaN   NaN  64.0
2  chemistry   NaN   NaN  88.0
3    biology   NaN   NaN  81.0

Alright, that worked..... well, yes... it worked...but...no, that is not what we wanted.
We got a new column *sem3*, which is good. Nevertheless, because we combined the DataFrames row-wise, we got some NaN values for sem1 and sem2, because the subjects are repeated.

**Note** In order to combined two DataFrames column-wise, we need to specify the axis argument in the concat function, to specify the axis we want to use for concatenation. In pandas, the default is axis = 0. In our case we should choose axis = 1.

In [58]:
df = pd.concat([david_df, sem3_scores_df], axis = 1)
df

    subjects  sem1  sem2   subjects  sem3
0       math    60    63       math    50
1    physics    70    71    physics    64
2  chemistry    80    85  chemistry    88
3    biology    90    89    biology    81

Great, this looks much better! But still, we are not 100% satisfied. Now we got two columns with the name *subject*. As we know that we only want the *sem3* column from the second DataFrame, we can specify this.

In [59]:
df = pd.concat([david_df, sem3_scores_df['sem3']], axis = 1)
df

    subjects  sem1  sem2  sem3
0       math    60    63    50
1    physics    70    71    64
2  chemistry    80    85    88
3    biology    90    89    81

Now we only concenated the original DataFrame with the *sem3* column of the new DataFrame. We did this column-wise by specifying the axis of concatenation.

### 4.2.3 Order matters! Rearranging column orders... <a class="anchor" id="section_4_2_3"></a>

Sometimes when we want to concatenate two DataFrames, the order of a column is different. This might lead to strange results. Lets look at an example.

In [60]:
# create additional DataFrame
sem3_scores = {
                'subjects': ['physics', 'chemistry', 'math', 'biology'], 
                'sem3': [50, 64, 88, 81]                
                }
sem3_scores_df = pd.DataFrame(sem3_scores)

df = pd.concat([david_df, sem3_scores_df['sem3']], axis = 1)
df

    subjects  sem1  sem2  sem3
0       math    60    63    50
1    physics    70    71    64
2  chemistry    80    85    88
3    biology    90    89    81

From the above result you can see that the marks of semester 3 does not align with the correct subject. In example, david got 88 points in math. According to the concatenated DataFrame he only got 50. 
You could also choose to concenate the whole second DataFrame with the first one, making it even more obvious.

In [61]:
# create additional DataFrame
sem3_scores = {
                'subjects': ['physics', 'chemistry', 'math', 'biology'], 
                'sem3': [50, 64, 88, 81]                
                }

df = pd.concat([david_df, sem3_scores_df], axis = 1)
df

    subjects  sem1  sem2   subjects  sem3
0       math    60    63    physics    50
1    physics    70    71  chemistry    64
2  chemistry    80    85       math    88
3    biology    90    89    biology    81

You can see that the subjects do not align!
Luckily, we can use Pandas to rearrange the order of the subjects, by choosing the order of the indexes when creating the DataFrame.

In [62]:
# create additional DataFrame
sem3_scores = {
                'subjects': ['physics', 'chemistry', 'math', 'biology'], 
                'sem3': [50, 64, 88, 81]                
                }
# Rearrange the indexes
sem3_scores_df = pd.DataFrame(sem3_scores, index=[1,2,0,3])
                                                 
df = pd.concat([david_df, sem3_scores_df], axis = 1)
df

    subjects  sem1  sem2   subjects  sem3
0       math    60    63       math    88
1    physics    70    71    physics    50
2  chemistry    80    85  chemistry    64
3    biology    90    89    biology    81

## 4.3 Concatenate DataFrames and Series <a class="anchor" id="section_4_3"></a>

Of course, pandas can also concatenate a Series to an excisting DataFrame. Lets try this...

In [63]:
s = pd.Series([88, 76, 74, 72], name = 'sem4')
s

0    88
1    76
2    74
3    72
Name: sem4, dtype: int64

In [64]:
df = pd.concat([david_df, s], axis = 1)
df

    subjects  sem1  sem2  sem4
0       math    60    63    88
1    physics    70    71    76
2  chemistry    80    85    74
3    biology    90    89    72

## 4.4 Concatenating multiple DataFrames and Series <a class="anchor" id="section_4_4"></a>

Now lets try to concatenate a combination of multiple DataFrames and Series.

In [65]:
df = pd.concat([david_df, sem3_scores_df['sem3'], s], axis = 1)
df

    subjects  sem1  sem2  sem3  sem4
0       math    60    63    88    88
1    physics    70    71    50    76
2  chemistry    80    85    64    74
3    biology    90    89    81    72

# 5. Sorting data in a DataFrame <a class="anchor" id="chapter5"></a>

Pandas provides a function *sort_values()* to perform various sorting operations on DataFrames.

In [66]:
import numpy as np
# creat a DataFrame

df = pd.DataFrame(
    {'alphabet': list('dpbskglaeh'),
     'numerical': [1, 2, np.nan, 6, 7, 10, 4, 3, 5, 8],
     'numerical2': [1, 5, 5, 8, 4, 9, 9, 3, 3, 5]})

df

  alphabet  numerical  numerical2
0        d        1.0           1
1        p        2.0           5
2        b        NaN           5
3        s        6.0           8
4        k        7.0           4
5        g       10.0           9
6        l        4.0           9
7        a        3.0           3
8        e        5.0           3
9        h        8.0           5

## 5.1 Sort columns  <a class="anchor" id="section_5_1"></a>

Sorting is mostly performed on columns, which can be identified by axis = 0. We will only cover column-wise sorting in this tutorial, but you could sort rows as well. Just specify axis = 1 instead.

In [80]:
df.sort_values('alphabet')
 
#There are two alternative ways of sorting the columns.
#All three lead to the same result though.

#df.sort_values(by = ['alphabet'])

#or

#df.sort_values(by = 'alphabet')

  alphabet  numerical  numerical2
7        a        3.0           3
2        b        NaN           5
0        d        1.0           1
8        e        5.0           3
5        g       10.0           9
9        h        8.0           5
4        k        7.0           4
6        l        4.0           9
1        p        2.0           5
3        s        6.0           8

As you can see, the alphabet column is perfectly sorted in ascenting order, staring from the letter a.
The sort_values() function accept an argument ascending, which is True by default. Setting this argument to False lets us sort in descending order.

In [81]:
df.sort_values(by = 'alphabet', ascending = False)

  alphabet  numerical  numerical2
3        s        6.0           8
1        p        2.0           5
6        l        4.0           9
4        k        7.0           4
9        h        8.0           5
5        g       10.0           9
8        e        5.0           3
0        d        1.0           1
2        b        NaN           5
7        a        3.0           3

## 5.2 Sorting multiple columns <a class="anchor" id="section_5_2"></a>

The *sort_values()* function accepts multiple arguments, meaning we can use multiple columns for sorting. The first given column is the preferred on. If column 1 has the same value as column 2, column 2 is used for sorting instead.

In [82]:
df.sort_values(by=['alphabet', 'numerical2'])

  alphabet  numerical  numerical2
7        a        3.0           3
2        b        NaN           5
0        d        1.0           1
8        e        5.0           3
5        g       10.0           9
9        h        8.0           5
4        k        7.0           4
6        l        4.0           9
1        p        2.0           5
3        s        6.0           8

## 5.3 Missing values <a class="anchor" id="section_5_3"></a>

We can see that the second column named 'numerical' has a NaN value. During sorting we can choose where we want to position missing values.

In [83]:
df.sort_values(by = ['numerical'])

  alphabet  numerical  numerical2
0        d        1.0           1
1        p        2.0           5
7        a        3.0           3
6        l        4.0           9
8        e        5.0           3
3        s        6.0           8
4        k        7.0           4
9        h        8.0           5
5        g       10.0           9
2        b        NaN           5

By default, missing values are placed at the end of the column. If you want to place them first, provide the *sort_values()* function with the na_position argument.

In [84]:
df.sort_values(by = ['numerical'], na_position = 'first')

  alphabet  numerical  numerical2
2        b        NaN           5
0        d        1.0           1
1        p        2.0           5
7        a        3.0           3
6        l        4.0           9
8        e        5.0           3
3        s        6.0           8
4        k        7.0           4
9        h        8.0           5
5        g       10.0           9

# 6. Conclusion <a class="anchor" id="chapter6"></a>

In this part of the tutorial we have seen how to create Series and Dataframes, how to read csv and text files into pandas. We also performed basic operations on rows and columns and learned how to group and sort data.

In the next part we will take a look on merge operations, how to handle missing data in Pandas and how we can drop columns from a DataFrame.